#Одно положительное
#Даны три целых числа: A, B, C. 
#Проверить истинность высказывания: "Хотя бы одно из чисел A, B, C положительное".
print('A')
a = int(input())
print('B')
b = int(input())
print('C')
c = int(input())

if a>0 or b>0 or c>0:
    print(True)
else: print(False)    