#Четырехзначное?
#Пользователь вводит целое число. 
#Выведите YES, если это число является четырехзначным, и NO в противном случае.

print('A')
a = int(input())

if a/1000>=1:
    print("Yes")
else:
    print('No')